## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                      - {
                          - remoteRef = {
                              - key      = "KUBECONFIG"
                              - property = "data.KUBECONFIG"
                            }
                          - secretKey = "KUBECONFIG"
                        },
                      - {
                          - remoteRef = {
                              - key      = "SSH_PRIVATE_KEY"
                              - property = "data.SSH_PRIVATE_KEY"
                            }
                          - secretKey = "SSH_PRIVATE_KEY"
                        },
                      - {
                          - remoteRef = {
                              - key      = "TF_VAR_PROXMOX_PASSWORD"
                              - property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          - secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                        {
                            remoteRef = {
                                key      = "AWS_ACCESS_KEY_ID"
                                property = "data.AWS_ACCESS_KEY_ID"
                            }
                            secretKey = "AWS_ACCESS_KEY_ID"
                        },
                        {
                            remoteRef = {
                                key      = "AWS_SECRET_ACCESS_KEY"
                                property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                            secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - remoteRef = {
                              - key      = "VAULT_TOKEN"
                              - property = "data.VAULT_TOKEN"
                            }
                          - secretKey = "VAULT_TOKEN"
                        },
                      - {
                          - remoteRef = {
                              - key      = "TF_VAR_VAULT_TOKEN"
                              - property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          - secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITHUB_PAT"
                              + property = "data.GITHUB_PAT"
                            }
                          + secretKey = "GITHUB_PAT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITLAB_TOKEN"
                              + property = "data.GITLAB_TOKEN"
                            }
                          + secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "ISTIO_PRIMARY_CA"
                              + property = "data.ISTIO_PRIMARY_CA"
                            }
                          + secretKey = "ISTIO_PRIMARY_CA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          + secretKey = "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootPassword"
                            }
                          + secretKey = "rootPassword"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootUser"
                            }
                          + secretKey = "rootUser"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.DATA"
                            }
                          + secretKey = "DATA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_DATABASE"
                            }
                          + secretKey = "POSTGRES_DATABASE"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_HOST"
                            }
                          + secretKey = "POSTGRES_HOST"
                        },
                        {
                            remoteRef = {
                                key      = "POSTGRES"
                                property = "data.POSTGRES_PASSWORD"
                            }
                            secretKey = "POSTGRES_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_PORT"
                            }
                          + secretKey = "POSTGRES_PORT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_USER"
                            }
                          + secretKey = "POSTGRES_USER"
                        },
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                        {
                            remoteRef = {
                                key      = "SOPS"
                                property = "data.SOPS"
                            }
                            secretKey = "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.GITLAB_TOKEN" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.HARBOR_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
              ~ namespaceSelector  = {
                  ~ matchLabels = {
                      + cluster-secrets               = "true"
                      - "kubernetes.io/metadata.name" = "default"
                    }
                }
                # (2 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "KUBECONFIG"
                              - metadataPolicy     = "None"
                              - property           = "data.KUBECONFIG"
                              - version            = null
                            }
                          - secretKey = "KUBECONFIG"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "SSH_PRIVATE_KEY"
                              - metadataPolicy     = "None"
                              - property           = "data.SSH_PRIVATE_KEY"
                              - version            = null
                            }
                          - secretKey = "SSH_PRIVATE_KEY"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "TF_VAR_PROXMOX_PASSWORD"
                              - metadataPolicy     = "None"
                              - property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              - version            = null
                            }
                          - secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "AWS_ACCESS_KEY_ID"
                                metadataPolicy     = "None"
                                property           = "data.AWS_ACCESS_KEY_ID"
                                version            = null
                            }
                            secretKey = "AWS_ACCESS_KEY_ID"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "AWS_SECRET_ACCESS_KEY"
                                metadataPolicy     = "None"
                                property           = "data.AWS_SECRET_ACCESS_KEY"
                                version            = null
                            }
                            secretKey = "AWS_SECRET_ACCESS_KEY"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "VAULT_TOKEN"
                              - metadataPolicy     = "None"
                              - property           = "data.VAULT_TOKEN"
                              - version            = null
                            }
                          - secretKey = "VAULT_TOKEN"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "TF_VAR_VAULT_TOKEN"
                              - metadataPolicy     = "None"
                              - property           = "data.TF_VAR_VAULT_TOKEN"
                              - version            = null
                            }
                          - secretKey = "TF_VAR_VAULT_TOKEN"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key                = "POSTGRES" -> "GITHUB_PAT"
                              ~ property           = "data.POSTGRES_PASSWORD" -> "data.GITHUB_PAT"
                                # (4 unchanged attributes hidden)
                            }
                          ~ secretKey = "POSTGRES_PASSWORD" -> "GITHUB_PAT"
                            # (1 unchanged attribute hidden)
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "REDIS"
                              - metadataPolicy     = "None"
                              - property           = "data.REDIS_PASSWORD"
                              - version            = null
                            }
                          - secretKey = "REDIS_PASSWORD"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "SOPS"
                              - metadataPolicy     = "None"
                              - property           = "data.SOPS"
                              - version            = null
                            }
                          - secretKey = "SOPS"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "GITLAB_TOKEN"
                                metadataPolicy     = "None"
                                property           = "data.GITLAB_TOKEN"
                                version            = null
                            }
                            secretKey = "GITLAB_TOKEN"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "HARBOR_KEY"
                                metadataPolicy     = "None"
                                property           = "data.HARBOR_KEY"
                                version            = null
                            }
                            secretKey = "HARBOR_KEY"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "ISTIO_PRIMARY_CA"
                              + metadataPolicy     = "None"
                              + property           = "data.ISTIO_PRIMARY_CA"
                              + version            = null
                            }
                          + secretKey = "ISTIO_PRIMARY_CA"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "KUBECONFIG"
                              + metadataPolicy     = "None"
                              + property           = "data.KUBECONFIG"
                              + version            = null
                            }
                          + secretKey = "KUBECONFIG"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "MINIO"
                              + metadataPolicy     = "None"
                              + property           = "data.rootPassword"
                              + version            = null
                            }
                          + secretKey = "rootPassword"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "MINIO"
                              + metadataPolicy     = "None"
                              + property           = "data.rootUser"
                              + version            = null
                            }
                          + secretKey = "rootUser"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "POSTGRES"
                              + metadataPolicy     = "None"
                              + property           = "data.DATA"
                              + version            = null
                            }
                          + secretKey = "DATA"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "POSTGRES"
                              + metadataPolicy     = "None"
                              + property           = "data.POSTGRES_DATABASE"
                              + version            = null
                            }
                          + secretKey = "POSTGRES_DATABASE"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = "Default"
                              + decodingStrategy   = "None"
                              + key                = "POSTGRES"
                              + metadataPolicy     = "None"
                              + property           = "data.POSTGRES_HOST"
                              + version            = null
                            }
                          + secretKey = "POSTGRES_HOST"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = null
                                  + kind       = null
                                  + name       = null
                                }
                              + storeRef     = {
                                  + kind = null
                                  + name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_PORT"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_PORT"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "POSTGRES"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.POSTGRES_USER"
                              + version            = (known after apply)
                            }
                          + secretKey = "POSTGRES_USER"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "REDIS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.REDIS_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "REDIS_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SSH_PRIVATE_KEY"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SSH_PRIVATE_KEY"
                              + version            = (known after apply)
                            }
                          + secretKey = "SSH_PRIVATE_KEY"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_PROXMOX_PASSWORD"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "TF_VAR_VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.TF_VAR_VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "VAULT_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.VAULT_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "VAULT_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
              ~ namespaceSelector      = {
                  ~ matchLabels      = {
                      + cluster-secrets               = "true"
                      - "kubernetes.io/metadata.name" = "default"
                    }
                    # (1 unchanged attribute hidden)
                }
                # (5 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.externaldns[0].kubernetes_cluster_role_binding.externaldns will be updated in-place
  ~ resource "kubernetes_cluster_role_binding" "externaldns" {
        id = "external-dns-viewer"

      ~ subject {
            name      = "external-dns"
          ~ namespace = "default" -> "externaldns"
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.externaldns[0].kubernetes_deployment.externaldns must be replaced
-/+ resource "kubernetes_deployment" "externaldns" {
      ~ id               = "default/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 4 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "default" -> "externaldns" # forces replacement
          ~ resource_version = "3848199" -> (known after apply)
          ~ uid              = "243bcaa0-08d2-41cf-9bbf-ae69c7bb0c2f" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                    # (13 unchanged attributes hidden)

                  ~ container {
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "external-dns"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (7 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                        # (1 unchanged block hidden)
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  ~ security_context {
                      - supplemental_groups    = [] -> null
                        # (5 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.externaldns[0].kubernetes_service_account.externaldns must be replaced
-/+ resource "kubernetes_service_account" "externaldns" {
      + default_secret_name             = (known after apply)
      ~ id                              = "default/external-dns" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "external-dns"
          ~ namespace        = "default" -> "externaldns" # forces replacement
          ~ resource_version = "8674" -> (known after apply)
          ~ uid              = "808d0662-1ce2-45de-9fac-23827d6d7d88" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.external_secrets[0].module.vault_token_secret.kubernetes_secret.this[0] will be updated in-place
  ~ resource "kubernetes_secret" "this" {
      ~ data                           = (sensitive value)
        id                             = "external-secrets/vault-token"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.externaldns[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "cluster-secrets"             = "true"
              + "kubernetes.io/metadata.name" = "externaldns"
            }
          + name             = "externaldns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 3 to change, 2 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                      - {
                          - remoteRef = {
                              - key      = "KUBECONFIG"
                              - property = "data.KUBECONFIG"
                            }
                          - secretKey = "KUBECONFIG"
                        },
                      - {
                          - remoteRef = {
                              - key      = "SSH_PRIVATE_KEY"
                              - property = "data.SSH_PRIVATE_KEY"
                            }
                          - secretKey = "SSH_PRIVATE_KEY"
                        },
                      - {
                          - remoteRef = {
                              - key      = "TF_VAR_PROXMOX_PASSWORD"
                              - property = "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          - secretKey = "TF_VAR_PROXMOX_PASSWORD"
                        },
                        {
                            remoteRef = {
                                key      = "AWS_ACCESS_KEY_ID"
                                property = "data.AWS_ACCESS_KEY_ID"
                            }
                            secretKey = "AWS_ACCESS_KEY_ID"
                        },
                        {
                            remoteRef = {
                                key      = "AWS_SECRET_ACCESS_KEY"
                                property = "data.AWS_SECRET_ACCESS_KEY"
                            }
                            secretKey = "AWS_SECRET_ACCESS_KEY"
                        },
                      - {
                          - remoteRef = {
                              - key      = "VAULT_TOKEN"
                              - property = "data.VAULT_TOKEN"
                            }
                          - secretKey = "VAULT_TOKEN"
                        },
                      - {
                          - remoteRef = {
                              - key      = "TF_VAR_VAULT_TOKEN"
                              - property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          - secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                        {
                            remoteRef = {
                                key      = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                property = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITHUB_PAT"
                              + property = "data.GITHUB_PAT"
                            }
                          + secretKey = "GITHUB_PAT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITLAB_TOKEN"
                              + property = "data.GITLAB_TOKEN"
                            }
                          + secretKey = "GITLAB_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "HARBOR_KEY"
                              + property = "data.HARBOR_KEY"
                            }
                          + secretKey = "HARBOR_KEY"
                        },
                      + {
                          + remoteRef = {
                              + key      = "ISTIO_PRIMARY_CA"
                              + property = "data.ISTIO_PRIMARY_CA"
                            }
                          + secretKey = "ISTIO_PRIMARY_CA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "KUBECONFIG"
                              + property = "data.KUBECONFIG"
                            }
                          + secretKey = "KUBECONFIG"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootPassword"
                            }
                          + secretKey = "rootPassword"
                        },
                      + {
                          + remoteRef = {
                              + key      = "MINIO"
                              + property = "data.rootUser"
                            }
                          + secretKey = "rootUser"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.DATA"
                            }
                          + secretKey = "DATA"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_DATABASE"
                            }
                          + secretKey = "POSTGRES_DATABASE"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_HOST"
                            }
                          + secretKey = "POSTGRES_HOST"
                        },
                        {
                            remoteRef = {
                                key      = "POSTGRES"
                                property = "data.POSTGRES_PASSWORD"
                            }
                            secretKey = "POSTGRES_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_PORT"
                            }
                          + secretKey = "POSTGRES_PORT"
                        },
                      + {
                          + remoteRef = {
                              + key      = "POSTGRES"
                              + property = "data.POSTGRES_USER"
                            }
                          + secretKey = "POSTGRES_USER"
                        },
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                        {
                            remoteRef = {
                                key      = "SOPS"
                                property = "data.SOPS"
                            }
                            secretKey = "SOPS"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "GITLAB_TOKEN" -> "SSH_PRIVATE_KEY"
                              ~ property = "data.GITLAB_TOKEN" -> "data.SSH_PRIVATE_KEY"
                            }
                          ~ secretKey = "GITLAB_TOKEN" -> "SSH_PRIVATE_KEY"
                        },
                      ~ {
                          ~ remoteRef = {
                              ~ key      = "HARBOR_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                              ~ property = "data.HARBOR_KEY" -> "data.TF_VAR_PROXMOX_PASSWORD"
                            }
                          ~ secretKey = "HARBOR_KEY" -> "TF_VAR_PROXMOX_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "TF_VAR_VAULT_TOKEN"
                              + property = "data.TF_VAR_VAULT_TOKEN"
                            }
                          + secretKey = "TF_VAR_VAULT_TOKEN"
                        },
                      + {
                          + remoteRef = {
                              + key      = "VAULT_TOKEN"
                              + property = "data.VAULT_TOKEN"
                            }
                          + secretKey = "VAULT_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
              ~ namespaceSelector  = {
                  ~ matchLabels = {
                      + cluster-secrets               = "true"
                      - "kubernetes.io/metadata.name" = "default"
                    }
                }
                # (2 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "KUBECONFIG"
                              - metadataPolicy     = "None"
                              - property           = "data.KUBECONFIG"
                              - version            = null
                            }
                          - secretKey = "KUBECONFIG"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "SSH_PRIVATE_KEY"
                              - metadataPolicy     = "None"
                              - property           = "data.SSH_PRIVATE_KEY"
                              - version            = null
                            }
                          - secretKey = "SSH_PRIVATE_KEY"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "TF_VAR_PROXMOX_PASSWORD"
                              - metadataPolicy     = "None"
                              - property           = "data.TF_VAR_PROXMOX_PASSWORD"
                              - version            = null
                            }
                          - secretKey = "TF_VAR_PROXMOX_PASSWORD"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "AWS_ACCESS_KEY_ID"
                                metadataPolicy     = "None"
                                property           = "data.AWS_ACCESS_KEY_ID"
                                version            = null
                            }
                            secretKey = "AWS_ACCESS_KEY_ID"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "AWS_SECRET_ACCESS_KEY"
                                metadataPolicy     = "None"
                                property           = "data.AWS_SECRET_ACCESS_KEY"
                                version            = null
                            }
                            secretKey = "AWS_SECRET_ACCESS_KEY"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "VAULT_TOKEN"
                              - metadataPolicy     = "None"
                              - property           = "data.VAULT_TOKEN"
                              - version            = null
                            }
                          - secretKey = "VAULT_TOKEN"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                      - {
                          - remoteRef = {
                              - conversionStrategy = "Default"
                              - decodingStrategy   = "None"
                              - key                = "TF_VAR_VAULT_TOKEN"
                              - metadataPolicy     = "None"
                              - property           = "data.TF_VAR_VAULT_TOKEN"
                              - version            = null
                            }
                          - secretKey = "TF_VAR_VAULT_TOKEN"
                          - sourceRef = {
                              - generatorRef = {
                                  - apiVersion = null
                                  - kind       = null
                                  - name       = null
                                }
                              - storeRef     = {
                                  - kind = null
                                  - name = null
                                }
                            }
                        },
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                                metadataPolicy     = "None"
                                property           = "data.EXTERNAL_DNS_PIHOLE_PASSWORD"
                                version            = null
                            }
                            secretKey = "EXTERNAL_DNS_PIHOLE_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    

... Output truncated due to size. See artifacts for full plan.
  ```
  
  Plan exit code: 0
  